# Chương 5

# Bắt đầu với pandas

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from pandas import Series, DataFrame

##  5.1 Introduction to pandas Data Structures

###  Series

In [4]:
obj = pd.Series([4, 7, -5, 3])

In [5]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])

In [9]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [11]:
obj2["a"]

-5

In [12]:
obj2["d"] = 6

In [13]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64

In [14]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [15]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [16]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [17]:
"b" in obj2

True

In [18]:
"e" in obj2

False

In [19]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [20]:
obj3 = pd.Series(sdata)

In [21]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [22]:
states = ["California", "Ohio", "Oregon", "Texas"]

In [23]:
obj4 = pd.Series(sdata, index=states)

In [24]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [25]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [26]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [27]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [28]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [29]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [31]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
dtype: float64

In [32]:
obj4.name = "population"

In [33]:
obj4.index.name = "state"

In [34]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [35]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]

In [36]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

###  DataFrame

In [37]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [38]:
frame = pd.DataFrame(data)

In [39]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [40]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [41]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [42]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [43]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])

In [45]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [44]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [46]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [47]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [48]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [49]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [50]:
frame2["debt"] = 16.5

In [51]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [52]:
frame2["debt"] = np.arange(6.)

In [53]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [54]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])

In [55]:
frame2["debt"] = val

In [56]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [60]:
frame2["eastern"] = frame2.state == "Ohio"

In [61]:
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

In [62]:
del frame2["eastern"]

In [63]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [64]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}}

In [65]:
frame3 = pd.DataFrame(populations)

In [66]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [67]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [68]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [69]:
pdata = {"Ohio": frame3["Ohio"][:-1], 
         "Nevada": frame3["Nevada"][:2]}

In [70]:

pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [71]:
frame3.index.name = "year"

In [72]:
frame3.columns.name = "state"

In [74]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [75]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [76]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

###  Đối tượng index

In [77]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])

In [78]:
index = obj.index

In [79]:
index

Index(['a', 'b', 'c'], dtype='object')

In [80]:
index[1:]

Index(['b', 'c'], dtype='object')

In [81]:
labels = pd.Index(np.arange(3))

In [82]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [83]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [84]:
obj2.index is labels

True

In [85]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [86]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [87]:
"Ohio" in frame3.columns

True

In [88]:
2003 in frame3.index

False

In [ ]:
pd.Index(["foo", "foo", "bar", "bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

## 5.2. Chức năng cơ bản quan trọng

### Tái lập chỉ mục

In [90]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])

In [91]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [92]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])

In [93]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [94]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [95]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [96]:
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [97]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=["a", "c", "d"],
                     columns=["Ohio", "Texas", "California"])

In [98]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [99]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])

In [100]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [101]:
states = ["Texas", "Utah", "California"]

In [ ]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [104]:
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [105]:
frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

### Xóa phần tử khỏi một trục

In [108]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])

In [109]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [110]:
new_obj = obj.drop("c")

In [111]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [112]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [113]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])

In [114]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [115]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [116]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [117]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [118]:
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [119]:
data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Đánh chỉ số, chọn lọc và lọc dữ liệu

In [120]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])

In [121]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [122]:
obj["b"]

1.0

In [123]:
obj[1]

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_20940\2469632899.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

1.0

In [124]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [125]:
obj[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [126]:
obj[[1, 3]]

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_20940\2982346117.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [127]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [128]:
obj.loc[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [129]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])

In [130]:
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [131]:
obj1

2    1
0    2
1    3
dtype: int64

In [132]:
obj2

a    1
b    2
c    3
dtype: int64

In [133]:
obj1[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [134]:
obj2[[0, 1, 2]]

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_20940\2599987575.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [135]:
obj1.iloc[[0, 1, 2]]

2    1
0    2
1    3
dtype: int64

In [136]:
obj2.iloc[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [137]:
obj2.loc["b":"c"]

b    2
c    3
dtype: int64

In [138]:
obj2.loc["b":"c"] = 5

In [139]:
obj2

a    1
b    5
c    5
dtype: int64

In [140]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])

In [141]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [142]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [143]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [144]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [145]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [146]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [147]:
data[data < 5] = 0

In [148]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Lựa chọn trên DataFrame với loc và iloc

In [150]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [151]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [152]:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [153]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int32

In [154]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [155]:
data.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [156]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [157]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [158]:
data.loc[:"Utah", "two"]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [159]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [160]:
data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Bẫy khi dùng chỉ số số nguyên

In [161]:
ser = pd.Series(np.arange(3.))

In [162]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [163]:
ser[-1]

KeyError: -1

In [164]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [165]:
ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])

In [166]:
ser2[-1]

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_20940\811950851.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser2[-1]

2.0

In [167]:
ser.iloc[-1]

2.0

In [168]:
ser[:2]

0    0.0
1    1.0
dtype: float64

#### “Bẫy” khi dùng chained indexing

In [169]:
data.loc[:, "one"] = 1

In [170]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [171]:
data.iloc[2] = 5

In [172]:
data.loc[data["four"] > 5] = 3

In [173]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [174]:
data.loc[data.three == 5, "three"] = 6

In [175]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

#### Số học và Căn chỉnh dữ liệu

In [176]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])

In [177]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=["a", "c", "e", "f", "g"])

In [179]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [180]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [178]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [181]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
                   index=["Ohio", "Texas", "Colorado"])

In [182]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                   index=["Utah", "Ohio", "Texas", "Oregon"])

In [183]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [184]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [185]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [186]:
df1 = pd.DataFrame({"A": [1, 2]})

In [187]:
df2 = pd.DataFrame({"B": [3, 4]})

In [188]:
df1

   A
0  1
1  2

In [189]:
df2

   B
0  3
1  4

In [190]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

#### Các phép toán số học với giá trị điền thay thế

In [191]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list("abcd"))

In [192]:

df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list("abcde"))

In [193]:
df2.loc[1, "b"] = np.nan

In [194]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [195]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [196]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [197]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [198]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [199]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [200]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Các phép toán giữa DataFrame và Series

In [201]:
arr = np.arange(12.).reshape((3, 4))

In [202]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [204]:
arr[0]

array([0., 1., 2., 3.])

In [203]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [205]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])

In [206]:
series = frame.iloc[0]

In [207]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [208]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [209]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [210]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])

In [211]:
series2

b    0
e    1
f    2
dtype: int32

In [212]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [213]:
series3 = frame["d"]

In [214]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [215]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [216]:
frame.sub(series3, axis="index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Áp dụng và ánh xạ hàm

In [217]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])

In [218]:
frame

               b         d         e
Utah   -1.205452  0.170537  0.297905
Ohio   -0.461858 -0.035974 -0.320660
Texas   0.067706 -0.361189  0.639779
Oregon -1.218373  0.021032  1.100064

In [219]:
np.abs(frame)

               b         d         e
Utah    1.205452  0.170537  0.297905
Ohio    0.461858  0.035974  0.320660
Texas   0.067706  0.361189  0.639779
Oregon  1.218373  0.021032  1.100064

In [220]:
def f1(x):
    return x.max() - x.min()

In [221]:
frame.apply(f1)

b    1.286079
d    0.531726
e    1.420723
dtype: float64

In [222]:
frame.apply(f1, axis="columns")

Utah      1.503357
Ohio      0.425884
Texas     1.000968
Oregon    2.318436
dtype: float64

In [223]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])

In [224]:
frame.apply(f2)

            b         d         e
min -1.218373 -0.361189 -0.320660
max  0.067706  0.170537  1.100064

In [225]:
def my_format(x):
    return f"{x:.2f}"

In [226]:
frame.applymap(my_format)

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_20940\1462544007.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  frame.applymap(my_format)

            b      d      e
Utah    -1.21   0.17   0.30
Ohio    -0.46  -0.04  -0.32
Texas    0.07  -0.36   0.64
Oregon  -1.22   0.02   1.10

In [227]:
frame["e"].map(my_format)

Utah       0.30
Ohio      -0.32
Texas      0.64
Oregon     1.10
Name: e, dtype: object

### Sắp xếp và xếp hạng

In [228]:
obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])

In [229]:
obj

d    0
a    1
b    2
c    3
dtype: int32

In [230]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [231]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=["three", "one"],
                     columns=["d", "a", "b", "c"])

In [232]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [233]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [234]:
frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [235]:
frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [236]:
obj = pd.Series([4, 7, -3, 2])

In [237]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [238]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [239]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [240]:
obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [241]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})

In [242]:
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [243]:
frame.sort_values(["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [244]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [245]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [246]:
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [247]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [248]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1], "c": [-2, 5, 8, -2.5]})

In [249]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [250]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Chỉ mục trùng lặp

In [251]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])

In [252]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [253]:
obj.index.is_unique

False

In [254]:
obj["a"]

a    0
a    1
dtype: int32

In [255]:
obj["c"]

4

In [256]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                  index=["a", "a", "b", "b", "c"])

In [257]:
df

          0         1         2
a  0.099433  0.585676 -0.106506
a  1.046868 -1.433725  0.734745
b  0.414371  0.264143 -0.897372
b -0.656062  0.277542  1.209551
c -0.670002  1.680445 -2.029311

In [258]:
df.loc["b"]

          0         1         2
b  0.414371  0.264143 -0.897372
b -0.656062  0.277542  1.209551

In [259]:
df.loc["c"]

0   -0.670002
1    1.680445
2   -2.029311
Name: c, dtype: float64

## 5.3. Tóm tắt và tính toán thống kê mô tả

In [260]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])

In [261]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [262]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [263]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [264]:
df.sum(axis="index", skipna=False)

one   NaN
two   NaN
dtype: float64

In [265]:
df.sum(axis="columns", skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [266]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [267]:
df.idxmax()

one    b
two    d
dtype: object

In [268]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [269]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [270]:
obj = pd.Series(["a", "a", "b", "c"] * 4)

In [271]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Tương quan và hiệp phương sai

### Giá trị duy nhất, đếm tần suất và kiểm tra thành viên

In [273]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [274]:
uniques = obj.unique()

In [275]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [276]:
obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [277]:
pd.value_counts(obj.to_numpy(), sort=False)

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_20940\164454357.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.to_numpy(), sort=False)

c    3
a    3
d    1
b    2
Name: count, dtype: int64

In [278]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [279]:
mask = obj.isin(['b', 'c'])

In [280]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [281]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [282]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [283]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [284]:
indices = pd.Index(unique_vals).get_indexer(to_match)

In [285]:
indices

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [286]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4], 
                     "Qu2": [2, 3, 1, 2, 3], 
                     "Qu3": [1, 5, 2, 4, 4]})

In [287]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [288]:
data["Qu1"].value_counts().sort_index()

Qu1
1    1
3    2
4    2
Name: count, dtype: int64

In [289]:
result = data.apply(pd.value_counts).fillna(0)

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_20940\2451317050.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  result = data.apply(pd.value_counts).fillna(0)

In [290]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [291]:
data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})

In [292]:
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [293]:
data.value_counts()

a  b
1  0    2
2  0    2
1  1    1
Name: count, dtype: int64